ams/src/Documents/AMS_ОбъединеннаяЗагрузка/AMS_ОбъединеннаяЗагрузка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>AMS_ОбъединеннаяЗагрузка</name>
  <posting>Deny</posting>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <type>
      <types>CatalogRef.ЗоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Обрешетка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <type>
      <types>EnumRef.СпособыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПередачиТоваров</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияОтгрузки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_КоличествоПалет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AMS_Объем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Реализации</name>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПалет</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДокумента</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаЛюбогоЗнака</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ams/src/Enums/AMS_СтатусыРеализаций/AMS_СтатусыРеализаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>AMS_СтатусыРеализаций</name>
  <enumValues>
    <name>Заказ</name>
  </enumValues>
  <enumValues>
    <name>Стикерование</name>
  </enumValues>
  <enumValues>
    <name>КОтгрузке</name>
  </enumValues>
  <enumValues>
    <name>Отгружено</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоРаспискеЭкспедитора</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоСканДов</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоДов</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоУПД</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоПоСканДов_УПД</name>
  </enumValues>
  <enumValues>
    <name>ОтгруженоУПДестьТНнет</name>
  </enumValues>
  <enumValues>
    <name>Закрыта</name>
  </enumValues>
  <enumValues>
    <name>ЗакрытаБезДоверенности</name>
  </enumValues>
  <enumValues>
    <name>ТОРГ_12_Удалить</name>
  </enumValues>
</mdclass:Enum>

ams/src/Documents/AMS_ОбъединеннаяЗагрузка/Forms/ФормаВыбораКлиента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Дата                 = Параметры.Дата;
	ОбъединеннаяЗагрузка = Параметры.ОбъединеннаяЗагрузка;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьСписокПартнеров();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПартнеры

&НаКлиенте
Процедура ПартнерыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗакрытьФорму(Партнеры[ВыбраннаяСтрока]);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	ЗакрытьФорму(Элементы.Партнеры.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьСписокПартнеров()
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", ОбъединеннаяЗагрузка);

	Запрос.Текст =
	"ВЫБРАТЬ
	|	т.Реализация КАК Реализация
	|ПОМЕСТИТЬ выкл
	|ИЗ
	|	Документ.AMS_ОбъединеннаяЗагрузка.Реализации КАК т
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.AMS_ОбъединеннаяЗагрузка КАК д
	|		ПО т.Ссылка = д.Ссылка
	|ГДЕ
	|	НЕ д.ПометкаУдаления
	|	И д.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И НЕ д.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	т.Ссылка КАК Ссылка,
	|	т.Дата КАК Дата,
	|	т.Номер КАК Номер,
	|	т.ЗонаДоставки КАК ЗонаДоставки,
	|	ВЫБОР
	|		КОГДА т.СпособДоставки = ЗНАЧЕНИЕ(Перечисление.СпособыДоставки.СиламиПеревозчикаПоАдресу)
	|			ТОГДА т.АдресДоставкиПеревозчика
	|		ИНАЧЕ т.АдресДоставки
	|	КОНЕЦ КАК АдресДоставки,
	|	т.Партнер КАК Партнер,
	|	т.СпособДоставки КАК СпособДоставки,
	|	т.AMS_СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	т.AMS_Обрешетка КАК Обрешетка,
	|	т.ВремяДоставкиС КАК ВремяДоставкиС,
	|	т.СуммаДокумента КАК СуммаДокумента,
	|	т.AMS_КоличествоПалет КАК AMS_КоличествоПалет,
	|	т.AMS_Вес КАК AMS_Вес,
	|	т.AMS_Объем КАК AMS_Объем
	|ПОМЕСТИТЬ док
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК т
	|ГДЕ
	|	т.Проведен
	|	И т.AMS_СтатусРеализации = ЗНАЧЕНИЕ(Перечисление.AMS_СтатусыРеализаций.КОтгрузке)
	|	И НЕ т.Ссылка В
	|		(ВЫБРАТЬ
	|			т.Реализация КАК Реализация
	|		ИЗ
	|			выкл КАК т)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	док.Партнер КАК Партнер,
	|	док.СпособДоставки КАК СпособДоставки,
	|	док.СпособПередачиТоваров КАК СпособПередачиТоваров,
	|	док.ЗонаДоставки КАК ЗонаДоставки,
	|	док.Обрешетка КАК Обрешетка,
	|	док.АдресДоставки КАК АдресДоставки,
	|	док.ВремяДоставкиС КАК ВремяДоставкиС,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ док.Ссылка) КАК КоличествоДокументов
	|ПОМЕСТИТЬ вт
	|ИЗ
	|	док КАК док
	|ГДЕ
	|	док.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ) И КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|СГРУППИРОВАТЬ ПО
	|	док.Партнер,
	|	док.СпособДоставки,
	|	док.ЗонаДоставки,
	|	док.АдресДоставки,
	|	док.ВремяДоставкиС,
	|	док.СпособПередачиТоваров,
	|	док.Обрешетка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	вт.Партнер КАК Партнер,
	|	вт.СпособДоставки КАК СпособДоставки,
	|	ВЫБОР
	|		КОГДА вт.СпособПередачиТоваров = 0
	|			ТОГДА ""Палетами""
	|		ИНАЧЕ ""Коробками""
	|	КОНЕЦ КАК СпособПередачиТоваров,
	|	вт.Обрешетка КАК Обрешетка,
	|	вт.ЗонаДоставки КАК ЗонаДоставки,
	|	вт.АдресДоставки КАК АдресДоставки,
	|	вт.ВремяДоставкиС КАК ВремяДоставкиС
	|ИЗ
	|	вт КАК вт
	|ГДЕ
	|	вт.КоличествоДокументов > 1";
	Рез = Запрос.Выполнить();
	Выб = Рез.Выбрать();

	НомерСтроки = 0;
	Пока Выб.Следующий() Цикл
		НомерСтроки = НомерСтроки + 1;
		Стр = Партнеры.Добавить();
		ЗаполнитьЗначенияСвойств(Стр, Выб);
		Стр.НомерСтроки = НомерСтроки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(ВыбраннаяСтрока)
	Данные = Новый Структура;
	Данные.Вставить("Партнер", ВыбраннаяСтрока.Партнер);
	Данные.Вставить("СпособДоставки", ВыбраннаяСтрока.СпособДоставки);
	Данные.Вставить("СпособПередачиТоваров", ?(ВыбраннаяСтрока.СпособПередачиТоваров = "Палетами", 0, 1));
	Данные.Вставить("Обрешетка", ВыбраннаяСтрока.Обрешетка);
	Данные.Вставить("ЗонаДоставки", ВыбраннаяСтрока.ЗонаДоставки);
	Данные.Вставить("АдресДоставки", ВыбраннаяСтрока.АдресДоставки);
	Данные.Вставить("ВремяДоставкиС", ВыбраннаяСтрока.ВремяДоставкиС);

	Закрыть(Данные);
КонецПроцедуры

#КонецОбласти
